Autodesk.Revit.DB.Lighting.LightDistribution.Clone
Creates a copy of the LightDistribution derived object.
Since:
2013

Autodesk.Revit.DB.Lighting.LightDistribution.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Lighting.LightDistribution
This class is the base class for specifying light distribution.
Since:
2013